 #pragma warning(disable:4996)
/*杨辉三角*/
//#include<stdio.h>
//int main()
//{
//	int i, j;
//	int shuzu[10][10] = { 0 };
//	for (i = 0; i<10; i++)
//		for (j = 0; j <= i; j++)
//		{
//			if (i == 0)
//				shuzu[i][j] = 1;
//			else if (j<1)
//				shuzu[i][j] = 1;
//			else if (i == j)
//				shuzu[i][j] = 1;
//			else
//				shuzu[i][j] = shuzu[i - 1][j - 1] + shuzu[i - 1][j];
//
//		}
//	for (i = 0; i<10; i++)
//	{
//		for (j = 0; j <= i; j++)
//			printf("%d\t", shuzu[i][j]);
//		printf("\n");
//		printf("\n");
//	}
//
//}



/*日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
嫌疑犯的一个。以下为4个嫌疑犯的供词。
A说：不是我。
B说：是C。
C说：是D。
D说：C在胡说
已知3个人说了真话，1个人说的是假话。
现在请根据这些信息，写一个程序来确定到底谁是凶手。
*/
//该种方法代码较陈杂，下面一种方法代码较为精炼
//#include <stdio.h>
//int main()
//{
//	int A = 0, B = 0, C = 0, D = 0;
//	int FD;//因为c和d的供词刚好对立 表示对立的
//	int i;
//	for (i = 1; i <= 4; i++)
//	{
//
//		if (i == 1)//A说的假
//		{
//			A = 1; C = 1; FD = 1; D = 0;
//		}
//		if (i == 2)//B说的假
//		{
//			A = 0; C = 0; FD = 1; D = 0;
//		}
//		if (i == 3)//C说的假
//		{
//			A = 0; C = 1; FD = 0; D = 0;
//		}
//		if (i == 4)//D的说的假
//		{
//			A = 0; C = 1; FD = 1; D = 0;
//		}
//		if (A + B + C + D + FD == 1 && FD == D)//只有一个人是凶手 当和为1时一个凶手出现  因为CD供词推出的都是D是不是 与上FD==D是为了排除D是D不是的情况 
//			printf("A=%d B=%d C=%d D=%d\n", A, B, C, D);
//	}
//	return 0;
//}




/*日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
嫌疑犯的一个。以下为4个嫌疑犯的供词。
A说：不是我。
B说：是C。
C说：是D。
D说：C在胡说
已知3个人说了真话，1个人说的是假话。
现在请根据这些信息，写一个程序来确定到底谁是凶手。
*/
//#include<stdio.h>
//int main()
//{
//	char killer = '0';
//	for (killer='A'; killer <= 'D'; killer++)
//	{
//		if (((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D')) == 3)
//		{
//			printf("killer is %c", killer);
//			break;
//		}
//	}
//	return 0;
//}





/*5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
A选手说：B第二，我第三；
B选手说：我第二，E第四；
C选手说：我第一，D第二；
D选手说：C最后，我第三；
E选手说：我第四，A第一；
比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。 */
//#include<stdio.h>
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (a != b && a != c && a != d && a != e && b != c && b != d && b != e && c != d && c != e && d != e)
//						{
//							if (((b == 2 || a == 3) == 1) && ((b == 2 && a == 3) == 0))
//							{
//								if (((b == 2 || e == 4) == 1) && ((b == 2 && e == 4) == 0))
//								{
//									if (((c == 1 || d == 2) == 1) && ((c == 1 && d == 2) == 0))
//									{
//										if (((c == 5 || d == 3) == 1) && ((c == 5 && d == 3) == 0))
//										{
//											if (((e == 4 || a == 1) == 1) && ((e == 4 && a == 1) == 0))
//											{
//												printf("a:%d  b:%d  c:%d  d:%d  e:%d\n", a, b, c, d, e);
//											}
//										}
//									}
//
//								}
//							}
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}