#include<stdio.h>
/*5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
A选手说：B第二，我第三；
B选手说：我第二，E第四；
C选手说：我第一，D第二；
D选手说：C最后，我第三；
E选手说：我第四，A第一；
比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。 */

//注意：续航符打出后需直接回车，然后再写代码，回车前回车会不能有空格，否则就会有警告
//注意：续航符后面不能加注释，否则直接报错 
int main()
{
	int a,b,c,d,e;
	int flag = 0;
	for (a = 1; a <= 5; a++)
		for (b = 1; b <= 5; b++)
			for (c = 1; c <= 5; c++)
				for (d = 1; d <= 5; d++)
					for (e = 1; e <= 5; e++)
					{
						flag = 0;
						if ((b == 2) + (a == 3) == 1 && \
						(b == 2) + (e == 4) == 1 && \
						(c == 1) + (d == 2) == 1 && \
						(c == 5) + (d == 3) == 1 && \
						(e == 4) + (a == 1) == 1)
							{
								flag |= 1 << (a-1);
								flag |= 1 << (b-1);
								flag |= 1 << (c-1);
								flag |= 1 << (d-1);
								flag |= 1 << (e-1);
								while (flag)
								{
									if (!(flag&1))
									break;
									flag >>= 1;
								}
								if (flag == 0)
								{
									printf("a:%d  b:%d  c:%d  d:%d  e:%d\n", a, b, c, d, e);
								}
							}
					} 
	return 0;
}
